import { defineStore } from "pinia";

export const useTestDataStore = defineStore("videoCarouselList", () => {
	const videoCarouselList = [
		{
			title: "蔚蓝档案0",
			summary: `基沃托斯是一座巨大的学术城市,由数千所学校组成。
                    在这里,学生之间持枪打架已成为家常便饭。
                    其中,被沙子覆盖的阿比多斯高中濒临关闭。
                    故事开始于努力逃离困境的“任务委员会”的五名学生遇到了名为“老师”的“大人”...`,
			img: "https://cdnimg.gamekee.com/wiki2.0/images/w_1600/h_1124/829/43637/2022/6/17/52233.jpg",
		},
		{
			title: "蔚蓝档案1",
			summary: `基沃托斯是一座巨大的学术城市,由数千所学校组成。
                    在这里,学生之间持枪打架已成为家常便饭。
                    其中,被沙子覆盖的阿比多斯高中濒临关闭。
                    故事开始于努力逃离困境的“任务委员会”的五名学生遇到了名为“老师”的“大人”...`,
			img: "https://cdnimg.gamekee.com/wiki2.0/images/w_1600/h_1124/829/43637/2022/6/17/396476.jpg",
		},
		{
			title: "蔚蓝档案2",
			summary: `基沃托斯是一座巨大的学术城市,由数千所学校组成。
                    在这里,学生之间持枪打架已成为家常便饭。
                    其中,被沙子覆盖的阿比多斯高中濒临关闭。
                    故事开始于努力逃离困境的“任务委员会”的五名学生遇到了名为“老师”的“大人”...`,
			img: "https://cdnimg.gamekee.com/wiki2.0/images/w_1600/h_1124/829/43637/2022/6/17/80491.jpg",
		},
		{
			title: "蔚蓝档案3",
			summary: `基沃托斯是一座巨大的学术城市,由数千所学校组成。
                    在这里,学生之间持枪打架已成为家常便饭。
                    其中,被沙子覆盖的阿比多斯高中濒临关闭。
                    故事开始于努力逃离困境的“任务委员会”的五名学生遇到了名为“老师”的“大人”...`,
			img: "https://cdnimg.gamekee.com/wiki2.0/images/w_1600/h_1124/829/287349/2023/4/9/954808.jpg",
		},
		{
			title: "蔚蓝档案4",
			summary: `基沃托斯是一座巨大的学术城市,由数千所学校组成。
                    在这里,学生之间持枪打架已成为家常便饭。
                    其中,被沙子覆盖的阿比多斯高中濒临关闭。
                    故事开始于努力逃离困境的“任务委员会”的五名学生遇到了名为“老师”的“大人”...`,
			img: "https://cdnimg.gamekee.com/wiki2.0/images/w_1600/h_1124/829/287349/2023/4/9/113058.jpg",
		},
		{
			title: "蔚蓝档案5",
			summary: `基沃托斯是一座巨大的学术城市,由数千所学校组成。
                    在这里,学生之间持枪打架已成为家常便饭。
                    其中,被沙子覆盖的阿比多斯高中濒临关闭。
                    故事开始于努力逃离困境的“任务委员会”的五名学生遇到了名为“老师”的“大人”...`,
			img: "https://cdnimg.gamekee.com/wiki2.0/images/w_1600/h_1124/829/287349/2023/4/9/83131.jpg",
		},
	];

	return { videoCarouselList };
});
